<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="1" name="decoder_input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="Parameter_8946" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="self.model.model.decoder.layers.3.encoder_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="0" size="589824" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.layers.3.encoder_attn.v_proj.weight">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.model.model.decoder.layers.3.encoder_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_14661" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="589824" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model.model.decoder.layers.3.encoder_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="579,tensor">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ShapeOf_14967" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_14974" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_14975" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="Gather_14976" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="120,174,249,303,378,432,507,561,90">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_5622" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="591368" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_5623" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="591376" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_5624" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="591384" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.model.decoder.layers.0.encoder_attn/prim::ListConstruct_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.model.decoder.layers.3.encoder_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="581">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.model.decoder.layers.3.encoder_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="591392" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.model.decoder.layers.3.encoder_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.3.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.model.decoder.layers.3.encoder_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="591408" size="589824" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.layers.3.encoder_attn.k_proj.weight">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.model.model.decoder.layers.3.encoder_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="572,tensor.45">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.model.decoder.layers.3.encoder_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="574">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.model.decoder.layers.3.encoder_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="591392" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.model.model.decoder.layers.3.encoder_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.3.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.model.decoder.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="f32" shape="51864, 384" offset="1181232" size="79663104" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.embed_tokens.weight">
					<dim>51864</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_14994" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="80844336" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.model.decoder/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="71">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.model.decoder.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.model.decoder.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="80844352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="29" name="__module.model.model.decoder.embed_tokens/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>51864</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="73,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="self.model.model.decoder.embed_positions.weight" type="Const" version="opset1">
			<data element_type="f32" shape="448, 384" offset="80844356" size="688128" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.embed_positions.weight">
					<dim>448</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="44" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64" names="44" />
			</output>
		</layer>
		<layer id="32" name="Constant_14968" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="33" name="Constant_14969" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="34" name="Gather_14970" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="68,74,84,86" />
			</output>
		</layer>
		<layer id="35" name="__module.model.model.decoder/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="81532492" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="36" name="__module.model.model.decoder/aten::arange/Range" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="76,cache_position">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.model.decoder/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="77,position_ids">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.model.decoder.embed_positions/aten::index/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.model.decoder.embed_positions/aten::index/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="80844352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="__module.model.model.decoder.embed_positions/aten::index/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="80,81,positions,positions.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model.model.decoder/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="82,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.model.decoder.layers.0.self_attn_layer_norm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="81532496" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.model.decoder.layers.0.self_attn_layer_norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_14662" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="81532500" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.model.decoder.layers.0.self_attn_layer_norm/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_14663" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="81534036" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.model.decoder.layers.0.self_attn_layer_norm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="115,hidden_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_14498" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="81535572" size="589824" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Multiply_14465" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_14664" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="82125396" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.model.decoder.layers.0.self_attn/aten::mul/Multiply" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="125,tensor.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_14995" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82126932" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.model.decoder.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="127">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="591392" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="128">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="self.model.model.decoder.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="82126964" size="589824" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.layers.0.self_attn.k_proj.weight">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.model.decoder.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131,tensor.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_14996" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82126932" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.model.decoder.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="133">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="591392" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.model.decoder.layers.0.self_attn/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="144,attn_weights.1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.model.decoder/aten::triu/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="80844352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="64" name="38" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="82716788" size="4" />
			<output>
				<port id="0" precision="FP32" names="38" />
			</output>
		</layer>
		<layer id="65" name="Constant_14977" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Reshape_14978" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.model.decoder/aten::add/Multiply_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="__module.model.model.decoder/aten::add/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="87,89" />
			</output>
		</layer>
		<layer id="69" name="Constant_4859" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="80844352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="70" name="Unsqueeze_4860" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.model.decoder/prim::ListConstruct_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.model.decoder/aten::full/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="92">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="ShapeOf_14979" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_14980" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="75" name="Constant_14981" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="Gather_14982" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32" />
			</output>
		</layer>
		<layer id="77" name="__module.model.model.decoder/aten::triu/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="81532492" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="78" name="__module.model.model.decoder/aten::triu/Range" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.model.decoder/aten::triu/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.model.decoder/aten::triu/Convert" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="81532492" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="81" name="Convert_14985" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="82" name="__module.model.model.decoder/aten::triu/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="83" name="__module.model.model.decoder/aten::triu/Range_1" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.model.decoder/aten::triu/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.model.decoder/aten::triu/GreaterEqual" type="GreaterEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.model.decoder/aten::triu/ConvertLike" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="80844352" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="__module.model.model.decoder/aten::triu/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="93_1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.model.decoder/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="80844352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="89" name="__module.model.model.decoder/aten::arange/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="81532492" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="90" name="__module.model.model.decoder/aten::arange/Range_1" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.model.decoder/aten::arange/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="94">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.model.decoder/aten::gt/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_4962" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="82716792" size="16" />
			<output>
				<port id="0" precision="I64" names="95">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.model.decoder/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="96">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.model.decoder/aten::gt/Greater" type="Greater" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="97">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.model.decoder/aten::mul_/ConvertLike" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.model.model.decoder/aten::mul_/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="93,causal_mask.1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.model.decoder/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="99">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="49" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64" names="49" />
			</output>
		</layer>
		<layer id="100" name="__module.model.model.decoder/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="100,101,102">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_13610" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_13612" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_13614" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.model.model.decoder/prim::ListConstruct_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.model.decoder/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="104,146,147,148,275,276,277,404,405,406,533,534,535,attention_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_5396" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="ShapeOf_14990" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_14991" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_14992" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="591360" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="110" name="Gather_14993" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="145,274,403,532">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_5399" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="81532484" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.model.decoder/aten::slice/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="82716808" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.model.model.decoder.layers.0.self_attn/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="149,278,407,536,causal_mask,causal_mask.5,causal_mask.7,causal_mask.9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.model.decoder.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="150,input.3">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.model.model.decoder.layers.0.self_attn/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="151,input.5">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="self.model.model.decoder.layers.0.self_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="82716816" size="589824" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.layers.0.self_attn.v_proj.weight">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.model.decoder.layers.0.self_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_14665" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="83306640" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.model.model.decoder.layers.0.self_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138,tensor.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_14997" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="82126932" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.model.model.decoder.layers.0.self_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="140">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="591392" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.model.decoder.layers.0.self_attn/aten::matmul/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="153,attn_output.1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Constant_4" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="591392" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.model.model.decoder.layers.0.self_attn/aten::transpose/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="154,attn_output.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_14998" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="83308176" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.model.decoder.layers.0.self_attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="156">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="self.model.model.decoder.layers.0.self_attn.out_proj.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384" offset="83308200" size="589824" />
			<output>
				<port id="0" precision="FP32" names="self.model.model.decoder.layers.0.self_attn.out_proj.weight">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="__module.model.model.decoder.layers.0.self_attn.out_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Constant_14666" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="83898024" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="__module.model.model.decoder.layers.0.self_attn.out_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="159,161,input.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="__module.model.model.decoder.layers.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="165,residual.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="__module.model.model.decoder.layers.0.encoder_attn_layer_norm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="81532496" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="__module.model.model.decoder.layers.0.encoder_attn_layer_norm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
